# Importing libraries

In [1]:
import pandas as pd
import numpy as np

# Importing the datasets

In [2]:
calls = pd.read_csv("data/04-sales_calls.csv")
print(calls)

revenue = pd.read_csv("data/04-sales_revenue.csv")
print(revenue)

  Team member  Territory  Month  Calls
0       Jorge          3      1    107
1       Jorge          3      2     88
2       Jorge          3      3     84
3       Jorge          3      4    113
4         Ana          1      1     91
5         Ana          1      2    129
6         Ana          1      3     96
7         Ana          1      4    128
8         Ali          2      1    120
9         Ali          2      2     85
   Territory  Month  Amount
0          1      1   54228
1          1      2   61640
2          1      3   43491
3          1      4   52173
4          2      1   36061
5          2      2   44957
6          2      3   35058
7          2      4   33855
8          3      1   50876
9          3      2   57682

# Appending dataframes

In [3]:
print(pd.concat([calls, revenue]))

  Team member  Territory  Month  Calls   Amount
0       Jorge          3      1  107.0      NaN
1       Jorge          3      2   88.0      NaN
2       Jorge          3      3   84.0      NaN
3       Jorge          3      4  113.0      NaN
4         Ana          1      1   91.0      NaN
5         Ana          1      2  129.0      NaN
6         Ana          1      3   96.0      NaN
7         Ana          1      4  128.0      NaN
8         Ali          2      1  120.0      NaN
9         Ali          2      2   85.0      NaN
0         NaN          1      1    NaN  54228.0
1         NaN          1      2    NaN  61640.0
2         NaN          1      3    NaN  43491.0
3         NaN          1      4    NaN  52173.0
4         NaN          2      1    NaN  36061.0
5         NaN          2      2    NaN  44957.0
6         NaN          2      3    NaN  35058.0
7         NaN          2      4    NaN  33855.0
8         NaN          3      1    NaN  50876.0
9         NaN          3      2    NaN  57682.0

# Merging dataframes

In [4]:
calls_revenue = pd.merge(calls, revenue, on=['Territory', 'Month'])
print(calls_revenue)

  Team member  Territory  Month  Calls  Amount
0       Jorge          3      1    107   50876
1       Jorge          3      2     88   57682
2         Ana          1      1     91   54228
3         Ana          1      2    129   61640
4         Ana          1      3     96   43491
5         Ana          1      4    128   52173
6         Ali          2      1    120   36061
7         Ali          2      2     85   44957

In [5]:
pd.merge(calls, revenue) # merging by default with 'iner'

  Team member  Territory  Month  Calls  Amount
0       Jorge          3      1    107   50876
1       Jorge          3      2     88   57682
2         Ana          1      1     91   54228
3         Ana          1      2    129   61640
4         Ana          1      3     96   43491
5         Ana          1      4    128   52173
6         Ali          2      1    120   36061
7         Ali          2      2     85   44957

In [6]:
pd.merge(calls, revenue, how='outer') # merging with 'outer'

   Team member  Territory  Month  Calls   Amount
0        Jorge          3      1  107.0  50876.0
1        Jorge          3      2   88.0  57682.0
2        Jorge          3      3   84.0      NaN
3        Jorge          3      4  113.0      NaN
4          Ana          1      1   91.0  54228.0
5          Ana          1      2  129.0  61640.0
6          Ana          1      3   96.0  43491.0
7          Ana          1      4  128.0  52173.0
8          Ali          2      1  120.0  36061.0
9          Ali          2      2   85.0  44957.0
10         NaN          2      3    NaN  35058.0
11         NaN          2      4    NaN  33855.0

# Other transformation

In [7]:
# Selecting data

print(calls_revenue[calls_revenue.Territory==3])

  Team member  Territory  Month  Calls  Amount
0       Jorge          3      1    107   50876
1       Jorge          3      2     88   57682

In [8]:
# Selecting data with calculated condition

print(calls_revenue[calls_revenue.Amount/calls_revenue.Calls>500])

  Team member  Territory  Month  Calls  Amount
1       Jorge          3      2     88   57682
2         Ana          1      1     91   54228
7         Ali          2      2     85   44957

In [9]:
# New calculated columns for dataframe

calls_revenue['Call_Amount'] = calls_revenue.Amount/calls_revenue.Calls
print(calls_revenue)

  Team member  Territory  Month  Calls  Amount  Call_Amount
0       Jorge          3      1    107   50876   475.476636
1       Jorge          3      2     88   57682   655.477273
2         Ana          1      1     91   54228   595.912088
3         Ana          1      2    129   61640   477.829457
4         Ana          1      3     96   43491   453.031250
5         Ana          1      4    128   52173   407.601562
6         Ali          2      1    120   36061   300.508333
7         Ali          2      2     85   44957   528.905882

In [10]:
# Getting all of the rows in which the amount per call is above the median
# (combining data)
    
print(calls_revenue.Call_Amount.median())
print(calls_revenue[calls_revenue.Call_Amount >= calls_revenue.Call_Amount.median()])

476.6530464391799
  Team member  Territory  Month  Calls  Amount  Call_Amount
1       Jorge          3      2     88   57682   655.477273
2         Ana          1      1     91   54228   595.912088
3         Ana          1      2    129   61640   477.829457
7         Ali          2      2     85   44957   528.905882

## Aggregation with GroupBy

In [11]:
calls_revenue.groupby('Team member')

In [12]:
calls_revenue.groupby('Team member')['Calls'].median()

Team member
Ali      102.5
Ana      112.0
Jorge     97.5
Name: Calls, dtype: float64

In [13]:
# The total calls and amounts by month...
print(calls_revenue[['Month', 'Calls', 'Amount']].groupby(['Month']).sum())

# ... and by territory
print(calls_revenue[['Territory', 'Calls', 'Amount']].groupby(['Territory']).sum())

       Calls  Amount
Month
1        318  141165
2        302  164279
3         96   43491
4        128   52173
           Calls  Amount
Territory
1            444  211532
2            205   81018
3            195  108558

In [14]:
# Iteration over groups

for (member, group) in calls_revenue.groupby('Team member'):
    print("{0:8s} shape={1}".format(member, group.shape))
    print(group)

Ali      shape=(2, 6)
  Team member  Territory  Month  Calls  Amount  Call_Amount
6         Ali          2      1    120   36061   300.508333
7         Ali          2      2     85   44957   528.905882
Ana      shape=(4, 6)
  Team member  Territory  Month  Calls  Amount  Call_Amount
2         Ana          1      1     91   54228   595.912088
3         Ana          1      2    129   61640   477.829457
4         Ana          1      3     96   43491   453.031250
5         Ana          1      4    128   52173   407.601562
Jorge    shape=(2, 6)
  Team member  Territory  Month  Calls  Amount  Call_Amount
0       Jorge          3      1    107   50876   475.476636
1       Jorge          3      2     88   57682   655.477273

In [15]:
# Aggregation

calls_revenue.groupby('Team member').aggregate([min, np.median, max])

            Territory            Month            Calls             Amount  \
                  min median max   min median max   min median  max    min
Team member
Ali                 2    2.0   2     1    1.5   2    85  102.5  120  36061
Ana                 1    1.0   1     1    2.5   4    91  112.0  129  43491
Jorge               3    3.0   3     1    1.5   2    88   97.5  107  50876

                            Call_Amount
              median    max         min      median         max
Team member
Ali          40509.0  44957  300.508333  414.707108  528.905882
Ana          53200.5  61640  407.601562  465.430354  595.912088
Jorge        54279.0  57682  475.476636  565.476954  655.477273

In [16]:
# Transformation

calls_revenue.groupby('Team member').transform(lambda x: x - x.mean())

   Territory  Month  Calls  Amount  Call_Amount
0        0.0   -0.5    9.5 -3403.0   -90.000319
1        0.0    0.5   -9.5  3403.0    90.000319
2        0.0   -1.5  -20.0  1345.0   112.318498
3        0.0   -0.5   18.0  8757.0    -5.764132
4        0.0    0.5  -15.0 -9392.0   -30.562339
5        0.0    1.5   17.0  -710.0   -75.992027
6        0.0   -0.5   17.5 -4448.0  -114.198775
7        0.0    0.5  -17.5  4448.0   114.198775

## One-Hot-Encoding

In [17]:
# Checking for the labels in the categorical parameters

print(calls_revenue['Team member'].unique())

['Jorge' 'Ana' 'Ali']

In [18]:
# Checking for the label counts in the categorical parameters

print(calls_revenue['Team member'].value_counts())

Ana      4
Jorge    2
Ali      2
Name: Team member, dtype: int64

In [19]:
# One-Hot encoding the categorical parameter

one_hot_encoded_data = pd.get_dummies(calls_revenue, columns = ['Team member'])
print(one_hot_encoded_data)

   Territory  Month  Calls  Amount  Call_Amount  Team member_Ali  \
0          3      1    107   50876   475.476636                0
1          3      2     88   57682   655.477273                0
2          1      1     91   54228   595.912088                0
3          1      2    129   61640   477.829457                0
4          1      3     96   43491   453.031250                0
5          1      4    128   52173   407.601562                0
6          2      1    120   36061   300.508333                1
7          2      2     85   44957   528.905882                1

   Team member_Ana  Team member_Jorge
0                0                  1
1                0                  1
2                1                  0
3                1                  0
4                1                  0
5                1                  0
6                0                  0
7                0                  0